/**
 * Пакет, содержащий пакеты и классы, связанные с подписками.
 * <p>
 * Этот пакет содержит все классы, которые необходимы для работы подписок в приложении.
 * </p>
 * <p>
 * Основные классы, представленные в этом пакете, включают следующее:
 * <ul>
 *     <li>SubscriptionService - интерфейс, который определяет основные операции для работы с подписками.</li>
 *     <li>SubscriptionServiceImpl - реализация интерфейса SubscriptionService.</li>
 *     <li>SubscriptionDTO - объект передачи данных, который представляет информацию о подписке в системе.</li>
 *     <li>Subscription - модель, которая представляет подписку в базе данных.</li>
 *     <li>SubscriptionRepository - интерфейс репозитория для работы с подписками в базе данных.</li>
 * </ul>
 * </p>
 */
package com.exchangeinformant.subscription;
