/**
 * Пакет, содержащий классы исключений, которые могут быть выброшены в ходе выполнения приложения.
 * Каждый класс исключения представляет конкретную ошибку, которая может произойти в системе,
 * и определяет свое уникальное сообщение об ошибке, а также способ ее обработки в коде.
 *
 * Классы исключений данного пакета могут быть использованы для полной обработки ошибок на всех уровнях
 * приложения - от контроллеров и сервисов до хранилища данных и внешних систем.
 * Для локализации текстов ошибок рекомендуется использовать файлы локализации.
 *
 */
package com.exchangeinformant.subscription.exception;
